# Pandas

Pandas (abbreviation of panel data) and the Panda DataFrame is powerful for manipulating large datasets and unlike Numpy can contain data of more than one type. It can also pull in and read CSV files.

## Basic Dataset - Cars by Country

In [3]:
import pandas as pd

cars = pd.read_csv("https://www.dropbox.com/s/ca49vrh44ye17lm/cars.csv?dl=1", index_col = 0)

cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

To make column selections of the data, square brackets can be used - single for a Panda series, or double for a Panda DataFrame.

In [4]:
print(cars['cars_per_cap'])

US     809
AUS    731
JAP    588
IN      18
RU     200
MOR     70
EG      45
Name: cars_per_cap, dtype: int64

Further sub-DataFrames can be made, creating a DataFrame from a pre-existing one, or selecting just one row but displaying it as a series in a column.

In [5]:
print(cars.loc['JAP'])

cars_per_cap      588
country         Japan
drives_right    False
Name: JAP, dtype: object

In [6]:
print(cars.loc[['US','AUS']])

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False

In [7]:
print(cars.loc[['MOR'], 'drives_right'])

print(cars.loc[['MOR', 'RU'], ['country', 'drives_right']])

MOR    True
Name: drives_right, dtype: bool
     country  drives_right
MOR  Morocco          True
RU    Russia          True

Another useful tool is adding custom columns to the dataset - either by a list or by existing variables.

In [8]:
# Now this has added a new column as specified by the list
cars["gdp"] = ['High', 'High', 'High', 'Medium', 'Medium', 'Low', 'Low']
cars

     cars_per_cap        country  drives_right     gdp
US            809  United States          True    High
AUS           731      Australia         False    High
JAP           588          Japan         False    High
IN             18          India         False  Medium
RU            200         Russia          True  Medium
MOR            70        Morocco          True     Low
EG             45          Egypt          True     Low

In [9]:
# Here a custom column "cars/100" is added dividing "cars_per_cap" by 100
cars["cars/100"] = cars["cars_per_cap"] / 100
cars

     cars_per_cap        country  drives_right     gdp  cars/100
US            809  United States          True    High      8.09
AUS           731      Australia         False    High      7.31
JAP           588          Japan         False    High      5.88
IN             18          India         False  Medium      0.18
RU            200         Russia          True  Medium      2.00
MOR            70        Morocco          True     Low      0.70
EG             45          Egypt          True     Low      0.45

To quickly understand the structure of the data in the Panda dataframe, use df.shape for columns & rows, df.describe for summary statistics and df.dtypes for data types.

## Advanced Datasets - Recent Graduates

## Understanding and Viewing Data

In [10]:
import numpy as np
import pandas as pd
#Import csv file
recent_grads = pd.read_csv("https://www.dropbox.com/s/4k6ii0jkjds2okk/recent-grads.csv?dl=1")

# Print data types
print(recent_grads.dtypes)

Rank                      int64
Major_code                int64
Major                    object
Total                   float64
Men                     float64
Women                   float64
Major_category           object
ShareWomen              float64
Sample_size               int64
Employed                  int64
Full_time                 int64
Part_time                 int64
Full_time_year_round      int64
Unemployed                int64
Unemployment_rate       float64
Median                    int64
P25th                     int64
P75th                     int64
College_jobs              int64
Non_college_jobs          int64
Low_wage_jobs             int64
dtype: object

In [11]:
#View the shape of the data
print(recent_grads.shape)

(173, 21)

In [12]:
#View the data in the DataFrame, sorted by selected column
recent_grads.sort_values('Total', ascending=False).head()

,Rank,Major_code,Major,Total,Men,Women,Major_category,ShareWomen,Sample_size,Employed,...,Part_time,Full_time_year_round,Unemployed,Unemployment_rate,Median,P25th,P75th,College_jobs,Non_college_jobs,Low_wage_jobs
145,146,5200,PSYCHOLOGY,393735.0,86648.0,307087.0,Psychology & Social Work,0.779933,2584,307933,...,115172,174438,28169,0.083811,31500,24000,41000,125148,141860,48207
76,77,6203,BUSINESS MANAGEMENT AND ADMINISTRATION,329927.0,173809.0,156118.0,Business,0.473190,4212,276234,...,50357,199897,21502,0.072218,38000,29000,50000,36720,148395,32395
123,124,3600,BIOLOGY,280709.0,111762.0,168947.0,Biology & Life Science,0.601858,1370,182295,...,72371,100336,13874,0.070725,33400,24000,45000,88232,81109,28339
57,58,6200,GENERAL BUSINESS,234590.0,132238.0,102352.0,Business,0.436302,2380,190183,...,36241,138299,14946,0.072861,40000,30000,55000,29334,100831,27320
93,94,1901,COMMUNICATIONS,213996.0,70619.0,143377.0,Communications & Journalism,0.669999,2394,179633,...,49889,116251,14602,0.075177,35000,27000,45000,40763,97964,27440

In [13]:
# Output summary statistics exluding object types
recent_grads.describe(exclude=['object'])

,Rank,Major_code,Total,Men,Women,ShareWomen,Sample_size,Employed,Full_time,Part_time,Full_time_year_round,Unemployed,Unemployment_rate,Median,P25th,P75th,College_jobs,Non_college_jobs,Low_wage_jobs
count,173.000000,173.000000,172.000000,172.000000,172.000000,172.000000,173.000000,173.000000,173.000000,173.000000,173.000000,173.000000,173.000000,173.000000,173.000000,173.000000,173.000000,173.000000,173.000000
mean,87.000000,3879.815029,39370.081395,16723.406977,22646.674419,0.522223,356.080925,31192.763006,26029.306358,8832.398844,19694.427746,2416.329480,0.068191,40151.445087,29501.445087,51494.219653,12322.635838,13284.497110,3859.017341
std,50.084928,1687.753140,63483.491009,28122.433474,41057.330740,0.231205,618.361022,50675.002241,42869.655092,14648.179473,33160.941514,4112.803148,0.030331,11470.181802,9166.005235,14906.279740,21299.868863,23789.655363,6944.998579
min,1.000000,1100.000000,124.000000,119.000000,0.000000,0.000000,2.000000,0.000000,111.000000,0.000000,111.000000,0.000000,0.000000,22000.000000,18500.000000,22000.000000,0.000000,0.000000,0.000000
25%,44.000000,2403.000000,4549.750000,2177.500000,1778.250000,0.336026,39.000000,3608.000000,3154.000000,1030.000000,2453.000000,304.000000,0.050306,33000.000000,24000.000000,42000.000000,1675.000000,1591.000000,340.000000
50%,87.000000,3608.000000,15104.000000,5434.000000,8386.500000,0.534024,130.000000,11797.000000,10048.000000,3299.000000,7413.000000,893.000000,0.067961,36000.000000,27000.000000,47000.000000,4390.000000,4595.000000,1231.000000
75%,130.000000,5503.000000,38909.750000,14631.000000,22553.750000,0.703299,338.000000,31433.000000,25147.000000,9948.000000,16891.000000,2393.000000,0.087557,45000.000000,33000.000000,60000.000000,14444.000000,11783.000000,3466.000000
max,173.000000,6403.000000,393735.000000,173809.000000,307087.000000,0.968954,4212.000000,307933.000000,251540.000000,115172.000000,199897.000000,28169.000000,0.177226,110000.000000,95000.000000,125000.000000,151643.000000,148395.000000,48207.000000

In [14]:
# select a single column and select the first five rows
sw_col = recent_grads['ShareWomen']
print(sw_col.head())

0    0.120564
1    0.101852
2    0.153037
3    0.107313
4    0.341631
Name: ShareWomen, dtype: float64

In [15]:
# view the max values for every column
recent_grads.max(axis=0)

Rank                               173
Major_code                        6403
Major                          ZOOLOGY
Total                           393735
Men                             173809
Women                           307087
Major_category          Social Science
ShareWomen                    0.968954
Sample_size                       4212
Employed                        307933
Full_time                       251540
Part_time                       115172
Full_time_year_round            199897
Unemployed                       28169
Unemployment_rate             0.177226
Median                          110000
P25th                            95000
P75th                           125000
College_jobs                    151643
Non_college_jobs                148395
Low_wage_jobs                    48207
dtype: object

## Manipulating Data

In [16]:
# find the max share of women in a major with numpy
women_max = recent_grads['ShareWomen'].max()

# use loc & idxmax for max of ShareWomen and a series of the other data
recent_grads.loc[recent_grads[['ShareWomen']].idxmax()]

,Rank,Major_code,Major,Total,Men,Women,Major_category,ShareWomen,Sample_size,Employed,...,Part_time,Full_time_year_round,Unemployed,Unemployment_rate,Median,P25th,P75th,College_jobs,Non_college_jobs,Low_wage_jobs
164,165,2307,EARLY CHILDHOOD EDUCATION,37589.0,1167.0,36422.0,Education,0.968954,342,32551,...,7001,20748,1360,0.040105,28000,21000,35000,23515,7705,2868

In [17]:
# use == to do the same thing as previous cell
recent_grads.loc[recent_grads['ShareWomen'] == women_max]

,Rank,Major_code,Major,Total,Men,Women,Major_category,ShareWomen,Sample_size,Employed,...,Part_time,Full_time_year_round,Unemployed,Unemployment_rate,Median,P25th,P75th,College_jobs,Non_college_jobs,Low_wage_jobs
164,165,2307,EARLY CHILDHOOD EDUCATION,37589.0,1167.0,36422.0,Education,0.968954,342,32551,...,7001,20748,1360,0.040105,28000,21000,35000,23515,7705,2868

Calls to .groupby() have the following three components: the column you want to group, the column you want to aggregate, and the statistic you want to aggregate by. For example, in our dataset, if we wanted to see the percentage of women ('sharewomen') per 'major_category', we could leverage a .groupby like so: 

recent_grads.groupby('major_category')['sharewomen'].mean(). 

Here, we are grouping by 'major_category', and aggregating 'sharewomen' by the mean.

In [18]:
# calculate the share of men as ShareMen
recent_grads['ShareMen'] = recent_grads['Men'] / recent_grads['Total']

# variable to identify rows with share of men higher than women
rows_with_more_men = recent_grads['ShareMen'] > recent_grads['ShareWomen']

# group by major category and a count
recent_grads.groupby(['Major_category']).Major_category.count()

Major_category
Agriculture & Natural Resources        10
Arts                                    8
Biology & Life Science                 14
Business                               13
Communications & Journalism             4
Computers & Mathematics                11
Education                              16
Engineering                            29
Health                                 12
Humanities & Liberal Arts              15
Industrial Arts & Consumer Services     7
Interdisciplinary                       1
Law & Public Policy                     5
Physical Sciences                      10
Psychology & Social Work                9
Social Science                          9
Name: Major_category, dtype: int64

In [19]:
# double checking this we can see indeed there is 5 majors in this category
recent_grads[recent_grads['Major_category'] == 'Law & Public Policy']

,Rank,Major_code,Major,Total,Men,Women,Major_category,ShareWomen,Sample_size,Employed,...,Full_time_year_round,Unemployed,Unemployment_rate,Median,P25th,P75th,College_jobs,Non_college_jobs,Low_wage_jobs,ShareMen
19,20,3201,COURT REPORTING,1148.0,877.0,271.0,Law & Public Policy,0.236063,14,930,...,808,11,0.011690,54000,50000,54000,402,528,144,0.763937
29,30,5402,PUBLIC POLICY,5978.0,2639.0,3339.0,Law & Public Policy,0.558548,55,4547,...,2776,670,0.128426,50000,35000,70000,1550,1871,340,0.441452
87,88,3202,PRE-LAW AND LEGAL STUDIES,13528.0,4435.0,9093.0,Law & Public Policy,0.672161,92,9762,...,5370,757,0.071965,36000,29200,46000,2002,6454,1336,0.327839
89,90,5401,PUBLIC ADMINISTRATION,5629.0,2947.0,2682.0,Law & Public Policy,0.476461,46,4158,...,2952,789,0.159491,36000,23000,60000,919,2313,496,0.523539
94,95,5301,CRIMINAL JUSTICE AND FIRE PROTECTION,152824.0,80231.0,72593.0,Law & Public Policy,0.475010,1728,125393,...,88548,11268,0.082452,35000,26000,45000,24348,88858,18404,0.524990

In [20]:
# convert a Pandas sub-DataFrame to a Numpy Array
recent_grads_np = np.array(recent_grads[['Unemployed', 'Low_wage_jobs']])
print(type(recent_grads_np))

<class 'numpy.ndarray'>

In [21]:
# find out if there is a correlation between low wage jobs and unemployment here (-1 to 1)
print(np.corrcoef(recent_grads_np[:,0],recent_grads_np[:,1]))

# the result is a strong correlation 0.96

[[1.         0.95538815]
 [0.95538815 1.        ]]

In [38]:
# find the average unemployment rate and number of low paid jobs per major category
dept_stats = recent_grads.groupby(['Major_category'])['Low_wage_jobs','Unemployment_rate'].mean()
print(dept_stats)

# write this to a csv file for circulation, columns optional argument
dept_stats.to_csv("new.csv", columns=['Low_wage_jobs','Unemployment_rate'])

                                     Low_wage_jobs  Unemployment_rate
Major_category
Agriculture & Natural Resources         789.900000           0.056328
Arts                                   7514.500000           0.090173
Biology & Life Science                 3053.000000           0.060918
Business                               9752.923077           0.071064
Communications & Journalism           12398.750000           0.075538
Computers & Mathematics                1466.909091           0.084256
Education                              2554.375000           0.051702
Engineering                             864.793103           0.063334
Health                                 2605.833333           0.065920
Humanities & Liberal Arts              6282.666667           0.081008
Industrial Arts & Consumer Services    3798.571429           0.048071
Interdisciplinary                      1061.000000           0.070861
Law & Public Policy                    4144.000000           0.090805
Physical Sciences                      1407.800000           0.046511
Psychology & Social Work               6249.555556           0.072065
Social Science                         6020.000000           0.095729

## Missing Values

One common task is to search for and replace missing values. NaN is 'not a number'.

In [23]:
#searching for missing values
recent_grads.isnull().sum()

Rank                    0
Major_code              0
Major                   0
Total                   1
Men                     1
Women                   1
Major_category          0
ShareWomen              1
Sample_size             0
Employed                0
Full_time               0
Part_time               0
Full_time_year_round    0
Unemployed              0
Unemployment_rate       0
Median                  0
P25th                   0
P75th                   0
College_jobs            0
Non_college_jobs        0
Low_wage_jobs           0
ShareMen                1
dtype: int64

In [24]:
# view the missing values of a column in relation to the wider DataFrame
recent_grads[recent_grads.ShareWomen.isnull()]

,Rank,Major_code,Major,Total,Men,Women,Major_category,ShareWomen,Sample_size,Employed,...,Full_time_year_round,Unemployed,Unemployment_rate,Median,P25th,P75th,College_jobs,Non_college_jobs,Low_wage_jobs,ShareMen
21,22,1104,FOOD SCIENCE,NaN,NaN,NaN,Agriculture & Natural Resources,NaN,36,3149,...,1735,338,0.096931,53000,32000,70000,1183,1274,485,NaN

In [25]:
# view all rows with missing data in the DataFrame
null_data = recent_grads[recent_grads.isnull().any(axis=1)]
null_data

,Rank,Major_code,Major,Total,Men,Women,Major_category,ShareWomen,Sample_size,Employed,...,Full_time_year_round,Unemployed,Unemployment_rate,Median,P25th,P75th,College_jobs,Non_college_jobs,Low_wage_jobs,ShareMen
21,22,1104,FOOD SCIENCE,NaN,NaN,NaN,Agriculture & Natural Resources,NaN,36,3149,...,1735,338,0.096931,53000,32000,70000,1183,1274,485,NaN

In [26]:
# drop all rows with any missing data from the DataFrame with a variable assigned
drop_null_rows = recent_grads.dropna(how="any")

# permanently drop all rows with any missing data
# perma_drop = recent_grads.dropna(how="any", inplace=True)

print(drop_null_rows.shape)
print(drop_null_rows.size)

(172, 22)
3784